Tekla Open API Reference for Tekla Structures 2025
ModelObject.SetUserProperty Method
Overload List
Name | Description
SetUserProperty(String, Double)
 Sets a double property for the model object.
SetUserProperty(String, Int32)
 Sets an integer property for the model object.
SetUserProperty(String, String)
 Sets a string property for the model object.
Top
See Also
Reference
ModelObject Class
Tekla.Structures.Model Namespace